integration/src/InformationRegisters/грОчередьДозапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грОчередьДозапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>idflow</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грОчередьДозапросов/Forms/РегистрацияДозапросов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ШаблонАлгоритма = "
	|//Ключи - Массив - базовая переменная
	|//ОтправлятьДозапросы - Булево - базовая переменная
	|
	|idflow = ""208"";
	|
	|Информация = Новый Структура;
	|Информация.Вставить( ""Описание"", ""корректировка данных"" );
	|
	|ДопПараметры = Новый Структура;
	|ДопПараметры.Вставить( ""ОтправлятьДозапрос"",  ОтправлятьДозапросы );
	|
	|МассивКлючей = СтрРазделить( Ключи, Символы.ПС );
	|Для каждого Ключ Из МассивКлючей Цикл
	|	
	|	Ключ = СтрЗаменить( Ключ, ""<"", """" );
	|	Ключ = СтрЗаменить( Ключ, "">"", """" );
	|	Если Не ЗначениеЗаполнено( Ключ ) Тогда
	|		Продолжить;
	|	КонецЕсли;
	|	
	|	РегистрыСведений.грОчередьДозапросов.ЗаписатьВОчередьДозапросов( Ключ, idflow, Информация, ДопПараметры );
	|	
	|КонецЦикла";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДозапросы(Команда)
	ЗаписатьДозапросыНаСервере();
	Сообщить( "Обработка завершена" );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДозапросыНаСервере()
	
	Выполнить( ШаблонАлгоритма );
		
КонецПроцедуры

#КонецОбласти
